Repository: huifan/Inpaint-iOS
Catalog: Inpaint/Localization/Localizable.xcstrings
Source language: en
Languages: ja, zh_hans

source: Back
ja: 戻る
zh_hans: 返回

source: Close
ja: 閉じる
zh_hans: 关闭

# tips_remove_watermark
source: Remove Watermark
ja: 水印削除
zh_hans: 一键去水印

# tips_id_photo
source: ID Photo
ja: 証明写真
zh_hans: 证件照换底

# tips_restore_photo
source: Restore Photo
ja: 写真修復
zh_hans: 老照片修复

source: Compare
ja: 比較
zh_hans: 对比

source: Inpaint
ja: 修復
zh_hans: 消除

# save_to_photo_lib
source: Save
ja: 写真に保存
zh_hans: 保存

source: Save Depth Map
ja: 深度マップを保存
zh_hans: 保存深度图

# toast_inpaint_warning
source: For optimal results, choose a smaller area to erase.
ja: 最適な結果を得るために、消去する範囲を小さく選んでください。
zh_hans: 为获最佳效果，建议选取较小消除区域

# toast_save_error
source: Error:
ja: 保存エラー:
zh_hans: 保存失败:

# toast_save_success
source: Success
ja: 写真がアルバムに保存されました
zh_hans: 图像成功保存到相册

# save_png
source: Save as PNG
ja: PNGとして保存
zh_hans: 保存为 PNG

# save_jpeg
source: Save as JPEG
ja: JPEGとして保存
zh_hans: 保存为 JPEG

source: Save to Files
ja: ファイルに保存
zh_hans: 保存到文件

source: Copy to Clipboard
ja: クリップボードにコピー
zh_hans: 复制到剪贴板

source: Share...
ja: 共有...
zh_hans: 分享...

# toast_copy_success
source: Copied to clipboard
ja: クリップボードにコピーしました
zh_hans: 已复制到剪贴板

source: Undo
ja: 取り消し
zh_hans: 撤销

# tool_watermark
source: Watermark
ja: 透かし
zh_hans: 水印

# watermark_text
source: Text
ja: 文字
zh_hans: 文字

# watermark_image
source: Image
ja: 画像
zh_hans: 图片

# watermark_opacity
source: Opacity
ja: 不透明度
zh_hans: 透明度

# watermark_color
source: Color
ja: 色
zh_hans: 颜色

# watermark_tiled
source: Tiled
ja: タイリング
zh_hans: 平铺

# watermark_enter_text
source: Enter Watermark Text
ja: 透かしテキストを入力
zh_hans: 输入水印文字

# watermark_text_hint
source: Watermark text
ja: 透かしテキスト
zh_hans: 水印文字

source: Watermark applied
ja: 透かしが適用されました
zh_hans: 水印已应用

source: Cancel
ja: キャンセル
zh_hans: 取消

# tool_photo_filter
source: Filters
ja: フィルター
zh_hans: 滤镜

# filter_original
source: Original
ja: オリジナル
zh_hans: 原图

# filter_bw_classic
source: B&W
ja: 白黒
zh_hans: 黑白

# filter_bw_noir
source: Noir
ja: ノワール
zh_hans: 黑白电影

# filter_vintage
source: Vintage
ja: ビンテージ
zh_hans: 复古

# filter_warm
source: Warm
ja: 暖色
zh_hans: 暖色调

# filter_cool
source: Cool
ja: 寒色
zh_hans: 冷色调

# filter_vivid
source: Vivid
ja: ビビッド
zh_hans: 鲜艳

# filter_fade
source: Fade
ja: フェード
zh_hans: 褪色

# filter_chrome
source: Chrome
ja: クローム
zh_hans: 铬色

# filter_intensity
source: Intensity
ja: 強度
zh_hans: 强度

source: Filter applied
ja: フィルターが適用されました
zh_hans: 滤镜已应用

# tool_smart_crop
source: Smart Crop
ja: スマートクロップ
zh_hans: 智能裁剪

# crop_free
source: Free
ja: フリー
zh_hans: 自由

# crop_smart
source: Smart
ja: スマート
zh_hans: 智能推荐

# crop_done
source: Crop
ja: クロップ
zh_hans: 裁剪

# crop_face_detected
source: Face detected
ja: 顔を検出しました
zh_hans: 检测到人脸

# crop_smart_applied
source: Smart crop applied
ja: スマートクロップを適用しました
zh_hans: 智能裁剪已应用

source: Crop applied
ja: クロップが適用されました
zh_hans: 裁剪已应用

# tool_text_removal
source: Text Removal
ja: 文字消除
zh_hans: 文字消除

# text_detect
source: Detect Text
ja: 文字を検出
zh_hans: 检测文字

# text_select_all
source: Select All
ja: すべて選択
zh_hans: 全选

# text_deselect_all
source: Deselect All
ja: 選択解除
zh_hans: 取消全选

# text_no_text_found
source: No text found
ja: 文字が見つかりません
zh_hans: 未检测到文字

# text_detected_count
source: Text regions detected: %d
ja: 検出された文字領域: %d
zh_hans: 检测到文字区域: %d

# text_remove
source: Remove
ja: 消除
zh_hans: 消除

# text_no_region_selected
source: No region selected
ja: 領域が選択されていません
zh_hans: 未选择区域

source: Text removed
ja: 文字が削除されました
zh_hans: 文字已消除

# text_already_removed
source: Text already removed. Undo to detect again.
ja: 文字は既に削除されています。再検出するには元に戻してください。
zh_hans: 文字已消除，撤销后可重新检测

# bg_solid_color
source: Solid Color
ja: ソリッドカラー
zh_hans: 纯色

# history_title
source: History
ja: 履歴
zh_hans: 历史记录

# history_empty
source: No edit history yet
ja: 編集履歴はありません
zh_hans: 暂无编辑记录

source: Clear All
ja: すべて削除
zh_hans: 清空全部

# clear_history_confirm_title
source: Clear all history?
ja: すべての履歴を削除しますか？
zh_hans: 确定清空所有历史记录？

# clear_history_confirm_message
source: This action cannot be undone.
ja: この操作は取り消せません。
zh_hans: 此操作无法撤销

source: Delete
ja: 削除
zh_hans: 删除

# delete_history_confirm_title
source: Delete this item?
ja: この項目を削除しますか？
zh_hans: 确定删除此项？

# watermark_type
source: Type
ja: タイプ
zh_hans: 类型

# watermark_text_placeholder
source: Enter text
ja: テキストを入力
zh_hans: 输入文字

# module_removal_repair
source: Removal & Repair
zh_hans: 修复与消除

# module_enhancement
source: Enhancement
zh_hans: 增强

# module_effects_creative
source: Effects & Creative
zh_hans: 效果与创意

# module_composition
source: Composition
zh_hans: 拼接与组合

# tool_inpainting
source: Object Remove
zh_hans: 物体消除

# tool_mosaic
source: Mosaic
zh_hans: 马赛克

# tool_3d_photo
source: 3D Photo
zh_hans: 3D照片

source: OK
zh_hans: 确定

source: Apply
zh_hans: 应用

source: Processing...
zh_hans: 处理中...

# mosaic_pixelate
source: Pixelate
zh_hans: 像素化

# mosaic_blur
source: Blur
zh_hans: 模糊

# mosaic_pixelate_selected
source: Pixelate mode
zh_hans: 像素化模式

# mosaic_blur_selected
source: Blur mode
zh_hans: 模糊模式

# toast_draw_first
source: Please draw on the area first
zh_hans: 请先涂抹需要处理的区域

# toast_purchase_failed
source: Purchase cancelled or failed
zh_hans: 购买取消或失败

# tool_background_removal
source: Remove BG
zh_hans: AI 去背景

# bg_transparent
source: Transparent
zh_hans: 透明

# bg_blur
source: Blur
zh_hans: 模糊

# bg_custom
source: Custom
zh_hans: 自定义

# remove_background
source: Remove
zh_hans: 去除背景

# processing_background_removal
source: Removing background...
zh_hans: 正在去除背景...

# error_ios17_required
source: This feature requires iOS 17 or later
zh_hans: 此功能需要 iOS 17 或更高版本

# tool_image_enhance
source: Enhance
zh_hans: AI 增强

# enhance_auto
source: Auto
zh_hans: 自动增强

# enhance_sr_2x
source: 2x HD
zh_hans: 2x 超清

# enhance_sr_4x
source: 4x HD
zh_hans: 4x 超清

# enhance_denoise
source: Denoise
zh_hans: 降噪

source: Enhance
zh_hans: 增强

# processing_sr
source: Enhancing image...
zh_hans: 正在增强图像...

# mosaic_crystallize
source: Crystal
zh_hans: 晶体化

# mosaic_triangle
source: Triangle
zh_hans: 三角像素

# mosaic_auto_face
source: Auto Face
zh_hans: 自动人脸

# mosaic_intensity
source: Intensity
zh_hans: 强度

# mosaic_no_faces
source: No faces detected
zh_hans: 未检测到人脸

# mosaic_faces_detected
source: Faces detected:
zh_hans: 检测到人脸:

# inpaint_tap_select
source: Tap to select object
zh_hans: 点击选择物体

# inpaint_model_512
source: Fast (512)
zh_hans: 快速 (512)

# inpaint_model_1024
source: Quality (1024)
zh_hans: 高质量 (1024)

# inpaint_object_selected
source: Object selected
zh_hans: 已选择物体

# brush_size
source: Brush
zh_hans: 画笔

# inpaint_no_object_found
source: No object found at tap point
zh_hans: 未在点击位置找到物体
